posts/greatest/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>greatest | chimez's blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://chimez.github.io/posts/greatest/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="chimez">
<link rel="prev" href="../gtags/" title="gtags" type="text/html">
<link rel="next" href="../ck-concurrency-kit/" title="ck: Concurrency Kit" type="text/html">
<meta property="og:site_name" content="chimez's blog">
<meta property="og:title" content="greatest">
<meta property="og:url" content="https://chimez.github.io/posts/greatest/">
<meta property="og:description" content='greatest: c 的单元测试


greatest 是 c 的一个单个头文件库，用于写单元测试




基本使用

#include "greatest.h"

/* A test runs various assertions, then calls PASS(), FAIL(), or SKIP(). */
TEST x_should_equal_1(void) {
    int x '>
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-06-27T15:47:29+08:00">
<meta property="article:tag" content="C">
<meta property="article:tag" content="unittest">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">chimez's blog</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">greatest</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    chimez
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2021-06-27T15:47:29+08:00" itemprop="datePublished" title="2021-06-27 15:47">2021-06-27 15:47</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-orgbfacba1" class="outline-2">
<h2 id="orgbfacba1">greatest: c 的单元测试</h2>
<div class="outline-text-2" id="text-orgbfacba1">
<p>
<a href="https://github.com/silentbicycle/greatest">greatest</a> 是 c 的一个单个头文件库，用于写单元测试
</p>
</div>

<div id="outline-container-org9ba8794" class="outline-3">
<h3 id="org9ba8794">基本使用</h3>
<div class="outline-text-3" id="text-org9ba8794">
<div class="highlight"><pre><span></span><span class="cp">#include</span><span class="w"> </span><span class="cpf">"greatest.h"</span><span class="cp"></span>

<span class="cm">/* A test runs various assertions, then calls PASS(), FAIL(), or SKIP(). */</span><span class="w"></span>
<span class="n">TEST</span><span class="w"> </span><span class="nf">x_should_equal_1</span><span class="p">(</span><span class="kt">void</span><span class="p">)</span><span class="w"> </span><span class="p">{</span><span class="w"></span>
<span class="w">    </span><span class="kt">int</span><span class="w"> </span><span class="n">x</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="mi">1</span><span class="p">;</span><span class="w"></span>
<span class="w">    </span><span class="cm">/* Compare, with an automatic "1 != x" failure message */</span><span class="w"></span>
<span class="w">    </span><span class="n">ASSERT_EQ</span><span class="p">(</span><span class="mi">1</span><span class="p">,</span><span class="w"> </span><span class="n">x</span><span class="p">);</span><span class="w"></span>

<span class="w">    </span><span class="cm">/* Compare, with a custom failure message */</span><span class="w"></span>
<span class="w">    </span><span class="n">ASSERT_EQm</span><span class="p">(</span><span class="s">"Yikes, x doesn't equal 1"</span><span class="p">,</span><span class="w"> </span><span class="mi">1</span><span class="p">,</span><span class="w"> </span><span class="n">x</span><span class="p">);</span><span class="w"></span>

<span class="w">    </span><span class="cm">/* Compare, and if they differ, print both values,</span>
<span class="cm">     * formatted like `printf("Expected: %d\nGot: %d\n", 1, x);` */</span><span class="w"></span>
<span class="w">    </span><span class="n">ASSERT_EQ_FMT</span><span class="p">(</span><span class="mi">1</span><span class="p">,</span><span class="w"> </span><span class="n">x</span><span class="p">,</span><span class="w"> </span><span class="s">"%d"</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="n">PASS</span><span class="p">();</span><span class="w"></span>
<span class="p">}</span><span class="w"></span>

<span class="cm">/* Suites can group multiple tests with common setup. */</span><span class="w"></span>
<span class="n">SUITE</span><span class="p">(</span><span class="n">the_suite</span><span class="p">)</span><span class="w"> </span><span class="p">{</span><span class="w"></span>
<span class="w">    </span><span class="n">RUN_TEST</span><span class="p">(</span><span class="n">x_should_equal_1</span><span class="p">);</span><span class="w"></span>
<span class="p">}</span><span class="w"></span>

<span class="cm">/* Add definitions that need to be in the test runner's main file. */</span><span class="w"></span>
<span class="n">GREATEST_MAIN_DEFS</span><span class="p">();</span><span class="w"></span>

<span class="kt">int</span><span class="w"> </span><span class="nf">main</span><span class="p">(</span><span class="kt">int</span><span class="w"> </span><span class="n">argc</span><span class="p">,</span><span class="w"> </span><span class="kt">char</span><span class="w"> </span><span class="o">**</span><span class="n">argv</span><span class="p">)</span><span class="w"> </span><span class="p">{</span><span class="w"></span>
<span class="w">    </span><span class="n">GREATEST_MAIN_BEGIN</span><span class="p">();</span><span class="w">      </span><span class="cm">/* command-line options, initialization. */</span><span class="w"></span>

<span class="w">    </span><span class="cm">/* Individual tests can be run directly in main, outside of suites. */</span><span class="w"></span>
<span class="w">    </span><span class="cm">/* RUN_TEST(x_should_equal_1); */</span><span class="w"></span>

<span class="w">    </span><span class="cm">/* Tests can also be gathered into test suites. */</span><span class="w"></span>
<span class="w">    </span><span class="n">RUN_SUITE</span><span class="p">(</span><span class="n">the_suite</span><span class="p">);</span><span class="w"></span>

<span class="w">    </span><span class="n">GREATEST_MAIN_END</span><span class="p">();</span><span class="w">        </span><span class="cm">/* display results */</span><span class="w"></span>
<span class="p">}</span><span class="w"></span>
</pre></div>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/c/" rel="tag">C</a></li>
            <li><a class="tag p-category" href="../../categories/unittest/" rel="tag">unittest</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../gtags/" rel="prev" title="gtags">Previous post</a>
            </li>
            <li class="next">
                <a href="../ck-concurrency-kit/" rel="next" title="ck: Concurrency Kit">Next post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2021         <a href="mailto:chimez@163.com">chimez</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
